server/app/controllers/knuxes_controller.rb

SELECT "knuxes".* FROM "knuxes"
---
    def index
        render json: Knux.all

INSERT INTO "knuxes" ("knux") VALUES (?)  [["knux", nil]]
---
    def create
        @knux = Knux.new(knux_params)
        @knux.save